In [2]:
import pandas as pd

In [14]:
data = {
    "name": ["Amit", "Sara", "John", "Fatima", "Rahim"],
    "age": [23, 29, 31, 25, 28],
    "salary": [40000, 52000, 60000, 45000, 48000],
    "department": ["IT", "HR", "IT", "Finance", "HR"]
}

df = pd.DataFrame(data, index=["e1", "e2", "c3","c4","e5"])
print(df)

      name  age  salary department
e1    Amit   23   40000         IT
e2    Sara   29   52000         HR
c3    John   31   60000         IT
c4  Fatima   25   45000    Finance
e5   Rahim   28   48000         HR

In [28]:
df.head(3)

    name  age  salary department
e1  Amit   23   40000         IT
e2  Sara   29   52000         HR
c3  John   31   60000         IT

In [6]:
df.columns

Index(['name', 'age', 'salary', 'department'], dtype='str')

In [22]:
names = ["Amit", "Sara", "John", "Fatima", "Rahim"]
ages = [23, 29, 31, 25, 28]
df2 = pd.DataFrame(zip(names, ages))
df2

        0   1
0    Amit  23
1    Sara  29
2    John  31
3  Fatima  25
4   Rahim  28

In [31]:
data3 = [["Amit", 23], ["Sara",29], ["John",31], ["Fatima",25], ["Rahim",28]]
df3 = pd.DataFrame(data3, columns=["Name", "Age"])
df3
df3.tail(3)

     Name  Age
2    John   31
3  Fatima   25
4   Rahim   28

In [16]:
df.describe()

             age        salary
count   5.000000      5.000000
mean   27.200000  49000.000000
std     3.193744   7549.834435
min    23.000000  40000.000000
25%    25.000000  45000.000000
50%    28.000000  48000.000000
75%    29.000000  52000.000000
max    31.000000  60000.000000

In [18]:
import seaborn as sb

Matplotlib is building the font cache; this may take a moment.